Repository: laporte727/chronomap-mobile-r
Catalog: lib/l10n/app_*.arb
Languages: fr, ja

# indexA
source: This is the mobile version of the "ChronoMap." Only essential data entry and country-specific searches are available. For full version features such as detailed registration and various searches, please access from a larger screen such as a PC or tablet at the following URL. http://app.laporte.academy
fr: Ceci est la version mobile de la "ChronoMap." Seule l'entrée des données essentielles et la recherche spécifique par pays sont disponibles. Pour utiliser la version complète, incluant l'enregistrement détaillé et diverses recherches, veuillez accéder via un écran plus grand tel qu'un PC ou une tablette à l'URL suivante. http://app.laporte.academy
ja: これは『四次元年表』のモバイル版です。『四次元年表』のうち必須項目の入力と国別検索のみご利用いただけます。詳細登録、各種検索等フルバージョンをご利用の場合は、PCやタブレットなど広い画面から以下にアクセスしてください。 http://app.laporte.academy

# indexB
source: The database of the "ChronoMap" is operated in English. Please always register country names in English using predictive text. For example, United States for America United Kingdom for Great Britain South Korea for Republic of Korea North Korea for Democratic People's Republic of Korea
fr: La base de données de la "ChronoMap" est gérée en anglais. Veuillez toujours enregistrer les noms de pays en anglais en utilisant la saisie prédictive. Par exemple, États-Unis pour America Royaume-Uni pour Great Britain Corée du Sud pour Republic of Korea Corée du Nord pour Democratic People's Republic of Korea
ja: 『四次元年表』のデータベースは英語表記で運用されています。国名は予測変換を用いて、必ず英語で登録してください。なお、 アメリカUnited States イギリスはUnited Kingdom 大韓民国はSouth Korea 朝鮮民主主義人民共和国はNorth Korea となります。

# indexC
source: If an event name is registered in Japanese, it will be progressively corrected to English. You can copy the CLASSIC view event names to use in your own translation tool.
fr: Si un nom d'événement est enregistré en japonais, il sera progressivement corrigé en anglais. Vous pouvez copier les noms des événements de la vue CLASSIC pour les utiliser dans votre propre outil de traduction.
ja: 事象名を日本語で登録された場合、順次、英語に修正されますのでご了承ください。CLASSIC表示の事象名は、コピーしてお手持ちの自動翻訳に掛けることができます。

# infoA
source: This app does not acquire any of your personal information, nor does it track or use information on your device.
fr: Cette application ne récupère aucune de vos informations personnelles, ni ne suit ni n'utilise les informations de votre appareil.
ja: このアプリは、あなたのどんな個人情報も一切取得しませんし、あなたのデバイス中の情報を追跡、利用することもありません。

# infoB
source: The historical information you register is not linked to you. There are no records of what you register or search for.
fr: Les informations historiques que vous enregistrez ne vous sont pas liées. Il n'y a pas d'enregistrement de ce que vous inscrivez ou recherchez.
ja: あなたが登録してくださった歴史情報があなたと紐付けられることはありません。あなたがなにを登録し、なにを検索したかはについて、記録は一切残りません。

# infoC
source: The "ChronoMap" is a database that encompasses all historical events from the origin of the universe to the endless 'now,' without regard to field. It aims to accurately display temporal and spatial distances, with 'when' and 'where' as mandatory items. Web version of "ChronoMap" https://app.laporte.academy Web version of three-dimensional and four-dimensional views https://tempo-spaco.web.app How to use the ChronoMap https://youtube.com/@laporte_academy
fr: La "ChronoMap" est une base de données qui englobe tous les événements historiques depuis l'origine de l'univers jusqu'à l'éternel 'maintenant,' sans égard au domaine. Elle vise à afficher correctement les distances temporelles et spatiales, avec 'quand' et 'où' comme éléments obligatoires. Version web de la "ChronoMap" https://app.laporte.academy Version web des vues tridimensionnelles et quadridimensionnelles https://tempo-spaco.web.app Comment utiliser la ChronoMap https://youtube.com/@laporte_academy
ja: 『四次元年表』とは宇宙の始原から終わりなき「今」に至る、全ての歴史的事象を、分野にかかわらず網羅するデータベースです。「いつ」だけでなく、｢どこで｣を必須項目とし、時間的距離、空間的距離を正しく表示することを目指します。 Web版『四次元年表』 https://app.laporte.academy Web版三次元・四次元表示 https://tempo-spaco.web.app 四次元年表の使い方 https://youtube.com/@laporte_academy

# infoD
source: In the "ChronoMap" a historical event refers to a single occurrence that is defined by 'when' and 'where' it took place. For example, the "English Civil War" is not considered a single event. Registration would look like "March 19, 1654, Battle of Hopton Heath, England." If you want to make it searchable as "English Civil War," please add "English Civil War" as a term in the web version of the "ChronoMap."
fr: Dans la "ChronoMap," un événement historique désigne un seul événement caractérisé par des informations sur "quand" et "où" il s'est produit. Par exemple, la "Guerre de Cent Ans" n'est pas considérée comme un événement unique. L'enregistrement serait "30 mai 1431, Exécution de Jeanne d'Arc, Rouen". Pour rendre cela recherchable sous le terme "Guerre de Cent Ans", veuillez ajouter "Guerre de Cent Ans" comme terme dans la version web de la "ChronoMap."
ja: 『四次元年表』における歴史的事象とは、「いつ、どこで」の情報を備えた、単一のできごとを指します。例えば「明治維新」は単一のできごととはみなされません。登録は 「1868年４月11日 徳川慶喜 水戸へ 日本 東京（江戸） 寛永寺」のようになります。これを｢明治維新｣として検索可能にする場合は、web版｢四次元年表｣において、termに「明治維新」を追加してください。

# infoE
source: Information contrary to the purpose of the "ChronoMap" will be handled by the administrator as follows. 1. Correction 2. Viewing stop (may be made public in the future) 3. Deletion
fr: Les informations contraires aux objectifs de la "ChronoMap" seront traitées par l'administrateur de la manière suivante. 1. Correction 2. Arrêt de la visualisation (peut être rendu public à l'avenir) 3. Suppression
ja: 『四次元年表』の趣旨に反する情報は、運営者によって以下の対応を取ります。 １、修正 ２、閲覧停止（将来公開される可能性あり） ３、削除

# infoF
source: The historical information you register is treated as a public good, and you yourself cannot delete it. Please be careful not to write personal information. If you want to delete information registered by mistake or find information that should be deleted, please contact the following address.
fr: Les informations historiques que vous enregistrez sont traitées comme un bien public, et vous-même ne pouvez pas les supprimer. Veuillez faire attention à ne pas écrire d'informations personnelles. Si vous souhaitez supprimer des informations enregistrées par erreur ou trouver des informations qui devraient être supprimées, veuillez contacter l'adresse suivante.
ja: 登録いただいた歴史情報は公共財として扱われ、登録したあなた自身でも削除することはできません。個人情報等を書き込まないようご注意ください。誤って登録した情報を削除したい場合、また、削除すべきと思われる情報を見つけた場合は、下記までご連絡ください。

# infoG
source: We are looking for people to join us in developing the "ChronoMap." If you are an engineer who can handle Flutter, AWS, PostgreSQL, Unity, etc., or can assist with data entry and correction, please contact us below.
fr: Nous recherchons des personnes pour nous rejoindre dans le développement de la "ChronoMap." Si vous êtes un ingénieur capable de gérer Flutter, AWS, PostgreSQL, Unity, etc., ou pouvez aider à la saisie et à la correction des données, veuillez nous contacter ci-dessous.
ja: 『四次元年表』開発をともにする方を求めています。Flutter、AWS、PostgreSQL, Unity等を扱えるエンジニアほか、データ入力やデータ修正等にご協力いただける方は、下記までご連絡ください。

# registerA
source: Entry
fr: Saisie
ja: 入力

# registerB
source: When
fr: Quand
ja: いつ

# registerC
source: In which country did it take place?
fr: Dans quel pays cela a-t-il eu lieu?
ja: 現在のどの国に相当する場所で

# registerD
source: What happened?
fr: Que s'est-il passé?
ja: なにがあった？

# registerE
source: Register
fr: Enregistrer
ja: 登録

# search
source: Enter the country name and touch the 🔍 to search. For a complete retrieval, touch with the field left blank.
fr: Entrez le nom du pays et touchez la loupe 🔍 pour rechercher. Pour une récupération complète, touchez avec le champ laissé vide.
ja: 国名を入力して🔍にタッチしてください '全件取得の場合は空欄のままタッチしてください。

# scalableA
source: Enter the country name and touch the 🔍 to search. For a complete retrieval, touch with the field left blank. Proceeding without touching will result in an error.
fr: Entrez le nom du pays et touchez la loupe 🔍 pour rechercher. Pour une récupération complète, touchez avec le champ laissé vide. Continuer sans toucher entraînera une erreur.
ja: 国名を入力して🔍にタッチしてください 全件取得の場合は空欄のままタッチしてください タッチせずに進むとエラーになります。

# scalableB
source: After touching the 🔍, please select the display area
fr: Après avoir touché la loupe 🔍, veuillez sélectionner la zone d'affichage
ja: 🔍にタッチしたら、表示域を選択してください

# gameA
source: Please choose a country from the predictive text. Starting the game without selecting any will target all entries.
fr: Veuillez choisir un pays à partir de la saisie prédictive. Commencer le jeu sans sélection en ciblera tous les entrées.
ja: 国名を予測変換から選んでください。 未選択でゲームを開始すると 全件が対象になります。

# gameB
source: Arrange the cards in the correct order.
fr: Rangez les cartes dans le bon ordre.
ja: カードを正しい順序に並べ替えてください。

# gameDialogA
source: Too bad!
fr: Dommage !
ja: 残念！

# gameDialogB
source: Would you like to try again?
fr: Voulez-vous réessayer ?
ja: 再挑戦しますか？

# gameDialogC
source: The same cards again
fr: Les mêmes cartes encore une fois
ja: 同じカードでもう一回

# gameDialogD
source: New cards
fr: Nouvelles cartes
ja: 新しいカード

# gameAlertA
source: Not enough events
fr: Pas assez d'événements
ja: 事象が足りません

# gameAlertB
source: At least 5 events are required
fr: Au moins 5 événements sont nécessaires
ja: ５件以上の事象が必要です

# gameAlertC
source: Add more events
fr: Ajouter plus d'événements
ja: 事象を追加する

# gameAlertD
source: Choose another country
fr: Choisir un autre pays
ja: 別の国を選ぶ

# cover
source: assets/images/cover_en.png
fr: assets/images/cover_fr.png
ja: assets/images/cover_ja.png

# registerAlertTitle0
source: Succeeded
ja: 成功しました

# registerAlertTitle1
source: Failed
ja: 失敗しました

# registerAlertTitle2
source: Failed
ja: 失敗しました

# registerAlertTitleD
source: Unexpected Error
ja: 予期しないエラー

# registerAlertContent0
source: Thank you for adding Information
ja: 情報を追加していただきありがとうございます

# registerAlertContent1
source: Oops! Something went wrong...
ja: おっと！何かがうまくいきませんでした...

# registerAlertContent2
source: Required fields are missing
ja: 必要な項目が欠けています

# registerAlertContentD
source: Please try again later
ja: 後でもう一度お試しください
